Repository: abbakary/fleet
Catalog: flutterapp/lib/l10n/app_*.arb
Languages: sw

# appTitle
source: Fleet Inspection
sw: Ukaguzi wa Magari

# appTitleShort
source: Fleet Inspection
sw: Ukaguzi wa Magari

# languageMenuTooltip
source: Change language
sw: Badilisha lugha

# languageMenuSystem
source: System default
sw: Chaguo la mfumo

# languageMenuEnglish
source: English
sw: Kiingereza

# loginTitle
source: Sign in to your account
sw: Ingia kwenye akaunti yako

# loginSubtitle
source: Enter your credentials to continue
sw: Weka taarifa zako ili kuendelea

# loginUsernameLabel
source: Username
sw: Jina la mtumiaji

# loginUsernameRequired
source: Username is required
sw: Jina la mtumiaji linahitajika

# loginPasswordLabel
source: Password
sw: Nywila

# loginPasswordRequired
source: Password is required
sw: Nywila inahitajika

# commonSignIn
source: Sign in
sw: Ingia

# commonSignOut
source: Sign out
sw: Toka

# unsupportedGreeting
source: Hello {name}
sw: Habari {name}

# unsupportedMessage
source: Your account role is not supported in the mobile app. Please use the web portal.
sw: Aina ya akaunti yako haiungwi mkono kwenye programu ya simu. Tafadhali tumia tovuti.

# guidedInspectionTitle
source: Guided Inspection
sw: Utaratibu wa Ukaguzi

# discardTooltip
source: Discard
sw: Tupa

# stepProgress
source: Step {current} of {total}
sw: Hatua {current} ya {total}

# vehicleLabel
source: Vehicle
sw: Gari

source: Scan VIN
sw: Skana VIN

source: Scan Plate
sw: Skana Nambari

# vinCaptureRequired
source: Capture the VIN
sw: Pata VIN

# vinIncomplete
source: VIN appears incomplete
sw: VIN haijaonekana kamili

# licensePlateLabel
source: License plate
sw: Nambari ya usajili

source: Enter license plate
sw: Weka nambari ya usajili

# odometerRequired
source: Enter odometer reading
sw: Weka kusoma kwa odometer

# odometerInvalid
source: Invalid odometer value
sw: Thamani ya odometer si sahihi

# generalVehicleConditionLabel
source: General vehicle condition
sw: Hali ya jumla ya gari

# generalVehicleConditionHint
source: Document any pre-existing dents, rust, or cleanliness concerns.
sw: Andika auandika mabaki ya matundu, kutu, au usafi.

# generalVehicleConditionRequired
source: Summarize vehicle condition
sw: Muhtasari wa hali ya gari

# identificationNotesLabel
source: Identification notes
sw: Maelezo ya utambuzi

# identificationNotesHint
source: Reference paperwork, assignments, or tag confirmations.
sw: Rejea karatasi, maagizo, au vibandiko vya lebo.

# identificationVerifiedTitle
source: Vehicle identification verified
sw: Utambulisho wa gari umehakikiwa

# identificationVerifiedSubtitle
source: VIN tag, license plate, and paperwork match the assignment.
sw: Leboko la VIN, nambari ya usajili, na karatasi vinaendana na agizo.

# stepMarkedNotApplicable
source: Step marked as not applicable for this inspection.
sw: Hatua imetiwa alama kuwa haitumiki kwa ukaguzi huu.

# stepEvidenceTitle
source: Step evidence
sw: Ushahidi wa hatua

# addButtonLabel
source: Add
sw: Ongeza

# photoEvidenceLogTitle
source: Photo evidence log
sw: Ripo la ushahidi wa picha

# photoEvidenceSectionStep
source: Step evidence
sw: Ushahidi wa hatua

# photoCountLabel
source: {count} photo(s)
sw: {count} picha

# backLabel
source: Back
sw: Rudi

# submitInspectionLabel
source: Submit inspection
sw: Tuma ukaguzi

# nextStepLabel
source: Next step
sw: Hatua inayofuata

# selectVehicleBeforeContinuing
source: Select a vehicle before continuing.
sw: Chagua gari kabla ya kuendelea.

# scanOrEnterVin
source: Scan or enter the VIN to continue.
sw: Skana au ingiza VIN ili kuendelea.

# captureLicensePlateToContinue
source: Capture the license plate to continue.
sw: Pata nambari ya usajili ili kuendelea.

# confirmIdentificationVerified
source: Confirm that vehicle identification has been verified.
sw: Thibitisha kwamba utambulisho wa gari umehakikiwa.

# captureBaselinePhoto
source: Capture a baseline photo before proceeding.
sw: Pata picha ya msingi kabla ya kuendelea.

# completeOperationalTests
source: Complete all operational tests before submitting.
sw: Kamilisha vipimo vyote vya uendeshaji kabla ya kutuma.

# completeGuidedActions
source: Complete the guided actions for {step} before continuing.
sw: Kamilisha hatua za {step} kabla ya kuendelea.

# selectVehicleBeforeSubmitting
source: Select a vehicle before submitting.
sw: Chagua gari kabla ya kutuma.

# inspectionSubmitted
source: Inspection submitted successfully.
sw: Ukaguzi umetumwa kwa mafanikio.

# inspectionSavedOffline
source: Inspection saved offline and will sync when online.
sw: Ukaguzi umehifadhiwa kwa offline na utaambatanishwa ukiwa mtandaoni.

# quickActionsNewInspection
source: New inspection
sw: Ukaguzi mpya

# quickActionsSyncOffline
source: Sync offline
sw: Sawa offline

# quickActionsRefresh
source: Refresh
sw: Sasisha

# syncingShort
source: Syncing…
sw: Inapitia…

# syncedCount
source: Synced {count} inspection(s).
sw: Imesawazishwa {count} ukaguzi(zi).

# syncedNone
source: No inspections waiting for sync.
sw: Hakuna ukaguzi unaosubiri kusawazishwa.

# addVehicleTitle
source: Add vehicle
sw: Ongeza gari

# licensePlateLabelShort
source: License plate
sw: Nambari ya usajili

# yearLabel
source: Year
sw: Mwaka

# vehicleTypeLabel
source: Vehicle type
sw: Aina ya gari

# notesLabel
source: Notes
sw: Maelezo

# cancelLabel
source: Cancel
sw: Ghairi

# saveLabel
source: Save
sw: Hifadhi

source: Vehicle added.
sw: Gari limeongezwa.

# photoAnnotateTitle
source: Annotate {contextTitle}
sw: Fafanua {contextTitle}

# clearAllTooltip
source: Clear all
sw: Futa vyote

# undoTooltip
source: Undo
sw: Rudisha

source: Unable to load image.
sw: Haiwezi kupakia picha.

# strokeWidthLabel
source: Stroke width: {width}
sw: Upana wa mstari: {width}

# saveLabelShort
source: Save
sw: Hifadhi

source: Unable to save annotated photo.
sw: Haiwezi kuhifadhi picha iliyobadilishwa.

# attachPhotoFor
source: Attach photo for "{contextTitle}"
sw: Unganisha picha kwa "{contextTitle}"

source: Use camera
sw: Tumia kamera

# useCameraSubtitle
source: Capture real-time evidence
sw: Pata ushahidi wa wakati halisi

source: Upload from gallery
sw: Pakia kutoka kwenye galerii

# uploadFromGallerySubtitle
source: Select from existing photos
sw: Chagua kutoka kwa picha zilizopo

# guidedActionsLabel
source: Guided actions
sw: Hatua za mwongozo

# guidedActionsProgress
source: {completed} of {total} completed
sw: {completed} ya {total} imekamilika

# stepMarkedNotApplicableShort
source: Not applicable
sw: Haitumiki

# photoRequiredLabel
source: Photo required
sw: Picha inahitajika

# segmentedPass
source: Pass
sw: Kupita

# segmentedFail
source: Fail
sw: Kushindwa

# segmentedNA
source: N/A
sw: Si lazima

# severityLabel
source: Severity
sw: Ukali

# severityMinor
source: Minor
sw: Ndogo

# severityLow
source: Low
sw: Chini

# severityModerate
source: Moderate
sw: Wastani

# severityHigh
source: High
sw: Juu

# severityCritical
source: Critical
sw: Kubwa

# severityUnknown
source: Unknown
sw: Haijulikani

# notesFieldLabel
source: Notes
sw: Maelezo

# photoEvidenceRequiredForFailure
source: Photo evidence is required for failures.
sw: Ushahidi wa picha unahitajika kwa makosa.

# stepNoChecklistItems
source: No checklist items were provided for this step. Add step notes or photos as needed.
sw: Hakukuwepo vitu vya orodha ya ukaguzi kwa hatua hii. Ongeza maelezo au picha inapobidi.

source: Trailer not attached
sw: Trela haikutangazwa

# trailerNotAttachedSubtitle
source: Skip this step if the power unit is inspected without a trailer.
sw: Ruka hatua hii ikiwa kitengo cha nguvu hakichunguzwi pamoja na trela.

# captureAtLeastOneAnnotatedPhoto
source: Capture at least one annotated photo when recording a failure.
sw: Pata angalau picha moja iliyobainishwa wakati wa kurekodi kosa.

# optionalAttachReferencePhotos
source: Optional — attach reference photos for this checklist item.
sw: Hiari — ambatanisha picha za kumbukumbu kwa kipengele hiki.

# photoEvidenceLabel
source: Photo evidence
sw: Ushahidi wa picha

# alignBarcodeHint
source: Align the barcode within the frame to capture.
sw: Panga barcode ndani ya fremu ili kuchukua.

# composeNotesVinCaptured
source: VIN captured: {vin}
sw: VIN imepatikana: {vin}

# composeNotesLicensePlate
source: License plate: {plate}
sw: Nambari ya usajili: {plate}

# composeNotesIdentificationVerified
source: Vehicle identification verified: {yesNo}
sw: Utambulisho wa gari umehakikiwa: {yesNo}

# step_pre_trip_documentation_title
source: Pre-Trip Documentation
sw: Nyaraka za Kabla ya Safari

# step_pre_trip_documentation_summary
source: Confirm vehicle identity, capture baseline readings, and note any pre-existing conditions before physical checks begin.
sw: Thibitisha utambulisho wa gari, pata kusoma za msingi, na andika hali yoyote iliyopo kabla ya kuanza ukaguzi wa kimwili.

# step_pre_trip_documentation_instruction_1
source: Scan the VIN or license plate using the guided scanner overlay.
sw: Skana VIN au nambari ya usajili kutumia overlay ya skana.

# step_pre_trip_documentation_instruction_2
source: Input the odometer and engine hours directly from the dashboard.
sw: Weka odometer na saa za injini moja kwa moja kutoka dashibodi.

# step_pre_trip_documentation_instruction_3
source: Document the overall vehicle condition with baseline photos and notes.
sw: Andika hali ya jumla ya gari kwa picha za msingi na maelezo.

# step_pre_trip_documentation_instruction_4
source: Verify vehicle identification against assignment paperwork before proceeding.
sw: Thibitisha utambulisho wa gari dhidi ya karatasi za agizo kabla ya kuendelea.

# step_exterior_structure_title
source: Exterior & Structural Inspection
sw: Ukaguzi wa Sehemu za Nje & Muundo

# step_exterior_structure_summary
source: Complete a clockwise walk-around, logging any structural defects with annotated photo proof.
sw: Fanya ukaguzi wa kuzunguka kwa kuzingatia mwanga wa mbele, pande, paa, na nyuma, ikiwa na picha zilizobainishwa.

# step_exterior_structure_instruction_1
source: Follow the guided walk-around indicators to cover front, sides, roofline, and rear.
sw: Fuata viashirio vya kuzunguka ili kufunika mbele, pande, mstari wa paa, na nyuma.

# step_exterior_structure_instruction_2
source: Document dents, cracks, rust, or loose body panels with annotated photo evidence.
sw: Andika mnato, nyufa, kutu, au paneli zilizotelekezwa kwa ushahidi wa picha.

# step_exterior_structure_instruction_3
source: Check frame rails, crossmembers, and chassis mounting points for structural damage.
sw: Angalia reli za fremu, crossmembers, na pointi za uingizaji wa chasi kwa uharibifu wa muundo.

# step_exterior_structure_instruction_4
source: Attach photo evidence for any exterior or structural defect before continuing.
sw: Ambatanisha picha kama ushahidi kwa kasoro za nje au za muundo kabla ya kuendelea.

# step_tires_wheels_axles_title
source: Tires, Wheels, & Axles
sw: Tayari, Magurudumu, & Axles

# step_tires_wheels_axles_summary
source: Measure and record tire health, wheel hardware, and axle condition for every wheel position.
sw: Pima na rekodi afya ya tairi, vifaa vya magurudumu, na hali ya axle kwa kila nafasi ya gurudumu.

# step_tires_wheels_axles_instruction_1
source: Measure and record tire pressure for every wheel position.
sw: Pima na rekodi shinikizo la tairi kwa kila nafasi ya gurudumu.

# step_tires_wheels_axles_instruction_2
source: Capture tread depth readings and note irregular wear patterns.
sw: Pata kina cha tread na andika mifumo isiyo ya kawaida ya kuvaa.

# step_tires_wheels_axles_instruction_3
source: Inspect sidewalls for cuts, bulges, or exposed cords and document defects.
sw: Angalia mwando wa pembeni kwa kukata, kupasuka, au kuonekana kwa nyuzi na andika kasoro.

# step_tires_wheels_axles_instruction_4
source: Check wheel rims, lug torque indicators, axles, and bearings for looseness or leaks.
sw: Angalia rim za magurudumu, viashiria vya torque za lug, axles, na bearings kwa msongamano au kuvuja.

# step_braking_system_title
source: Braking System
sw: Mfumo wa Breki

# step_braking_system_summary
source: Assess service, emergency, and parking brake components with evidence of wear conditions.
sw: Pima vipengele vya breki za huduma, dharura, na park na ushahidi wa hali ya kuvaa.

# step_braking_system_instruction_1
source: Inspect brake pads or shoes, drums, and rotors for thickness and heat checking.
sw: Angalia pads za breki au shoes, drums, na rotors kwa unene na dalili za moto.

# step_braking_system_instruction_2
source: Document hydraulic or air brake components, hoses, and fittings for leaks or wear.
sw: Andika vipengele vya breki za majimaji au hewa, hose, na fittings kwa kuvuja au kuvaa.

# step_braking_system_instruction_3
source: Check supply lines, reservoirs, and valves for chafing or improper routing.
sw: Angalia mistari ya usambazaji, mabomba, na valves kwa kuchafuka au upangaji usio sahihi.

# step_braking_system_instruction_4
source: Test parking brake application and record responsiveness.
sw: Jaribu matumizi ya breki ya park na rekodi ufanisi.

# step_suspension_steering_summary
source: Evaluate stability and alignment components, ensuring safe handling performance.
sw: Tathmini utulivu na vipengele vya upangaji upangaji, kuhakikisha utendaji salama wa kushughulikia.

# step_suspension_steering_instruction_1
source: Check springs, shock absorbers, and air bags for leaks, cracks, or uneven ride height.
sw: Angalia springs, shock absorbers, na airbags kwa kuvuja, nyufa, au mwinuko wa usawa.

# step_suspension_steering_instruction_2
source: Inspect steering linkage, tie rods, and kingpins for free play or damage.
sw: Angalia linkage ya udhibiti, tie rods, na kingpins kwa mchezo au uharibifu.

# step_suspension_steering_instruction_3
source: Document suspension mounts, bushings, torque arms, and u-bolts for wear.
sw: Andika mounts za suspension, bushings, torque arms, na u-bolts kwa kuvaa.

# step_suspension_steering_instruction_4
source: Confirm alignment indicators and steering wheel centering.
sw: Thibitisha viashirio vya ulinganifu na uwekaji wa gurudumu la mwelekeo.

# step_engine_powertrain_title
source: Engine & Powertrain
sw: Injini & Powertrain

# step_engine_powertrain_summary
source: Capture engine bay health including fluids, belts, and drivetrain integrity.
sw: Pata afya ya bay ya injini ikijumuisha mafuta, belts, na uimara wa drivetrain.

# step_engine_powertrain_instruction_1
source: Verify oil, coolant, transmission, DEF, and hydraulic fluid levels are within range.
sw: Thibitisha kiwango cha mafuta, coolant, transmishe, DEF, na mafuta ya majimaji ni ndani ya kizingiti.

# step_engine_powertrain_instruction_2
source: Inspect belts, hoses, clamps, and air filters for cracking or looseness.
sw: Angalia belts, hoses, clamps, na vichujio vya hewa kwa nyufa au ustawi mdogo.

# step_engine_powertrain_instruction_3
source: Document exhaust system condition, mounts, and evidence of leaks.
sw: Andika hali ya mfumo wa kutolea hewa, mounts, na dalili za kuvuja.

# step_engine_powertrain_instruction_4
source: Check drivetrain components, seals, and housings for leaks or abnormal noise.
sw: Angalia vipengele vya drivetrain, seals, na housings kwa kuvuja au kelele zisizo za kawaida.

# step_electrical_lighting_title
source: Electrical & Lighting
sw: Umeme & Taa

# step_electrical_lighting_summary
source: Systematically test all lighting circuits and core electrical systems.
sw: Jaribu mfululizo wa taa na mifumo ya msingi ya umeme kwa mpangilio.

# step_electrical_lighting_instruction_1
source: Run the systematic lighting test covering headlights, tail lights, and brake lights.
sw: Fanya jaribio la taa kwa headlights, tail lights, na brake lights.

# step_electrical_lighting_instruction_2
source: Cycle turn signals, marker lights, and hazard flashers verifying synchronization.
sw: Geuza ishara za kugeuza, taa za alama, na flashers za hatari kuthibitisha ulinganifu.

# step_electrical_lighting_instruction_3
source: Inspect interior lighting, dashboard instruments, and warning indicators.
sw: Angalia taa za ndani, vyombo vya dashibodi, na viashirio vya tahadhari.

# step_electrical_lighting_instruction_4
source: Check batteries, wiring harnesses, and connectors for corrosion or loose terminals.
sw: Angalia betri, harness ya waya, na connectors kwa kutu au terminals zilizolegea.

# step_cabin_interior_title
source: Cabin & Interior
sw: Kabati & Ndani

# step_cabin_interior_summary
source: Validate driver safety equipment, visibility systems, and control panel readiness.
sw: Thibitisha vifaa vya usalama vya dereva, mfumo wa mwonekano, na utayari wa paneli ya udhibiti.

# step_cabin_interior_instruction_1
source: Verify seat belts, seat tracks, and headrests for secure operation.
sw: Thibitisha mikanda ya kiti, reli za kiti, na headrests kwa uendeshaji salama.

# step_cabin_interior_instruction_2
source: Inspect mirrors, windshield, wipers, washers, and defrosters for visibility.
sw: Angalia vioo, windshield, wipers, washers, na defrosters kwa mwonekano.

# step_cabin_interior_instruction_3
source: Test dashboard instruments, controls, HVAC, and infotainment systems.
sw: Jaribu vyombo vya dashibodi, controls, HVAC, na mifumo ya habari.

# step_cabin_interior_instruction_4
source: Confirm emergency equipment, paperwork, and safety signage are accessible.
sw: Thibitisha vifaa vya dharura, karatasi, na signage ya usalama zinaweza kufikiwa.

# step_coupling_connections_summary
source: Verify trailer coupling, lines, and safety connections where applicable.
sw: Thibitisha coupling ya trela, mistari, na uhusiano wa usalama inapohitajika.

# step_coupling_connections_instruction_1
source: Inspect fifth wheel, kingpin, pintle, or gooseneck components for secure locking and wear.
sw: Angalia fifth wheel, kingpin, pintle, au gooseneck kwa kufungwa salama na kuvaa.

# step_coupling_connections_instruction_2
source: Verify safety chains, breakaway cables, and locking pins are present and undamaged.
sw: Thibitisha minyororo ya usalama, waya za kuvunja, na pini za kufunga zipo na hazijaharibika.

# step_coupling_connections_instruction_3
source: Check electrical connectors, glad hands, and air lines for leaks or abrasion.
sw: Angalia connectors za umeme, glad hands, na mistari ya hewa kwa kuvuja au msongamano.

# step_coupling_connections_instruction_4
source: Capture supporting photos for any missing or worn coupling hardware.
sw: Pata picha za msaada kwa vifaa vya coupling vilivyokosa au vilivyovaliwa.

# step_safety_equipment_title
source: Safety Equipment
sw: Vifaa vya Usalama

# step_safety_equipment_summary
source: Confirm emergency preparedness equipment is present, charged, and within service dates.
sw: Thibitisha vifaa vya dharura vipo, vimekusanywa, na ndani ya tarehe za huduma.

# step_safety_equipment_instruction_1
source: Check fire extinguisher charge level, inspection tag, and security seal.
sw: Angalia kiwango cha chaji cha mzima wa moto, tag ya ukaguzi, na muhuri wa usalama.

# step_safety_equipment_instruction_2
source: Verify warning triangles, flares, and reflective devices are present and serviceable.
sw: Thibitisha pembeni vya tahadhari, mwanga wa tahadhari, na vifaa vya kuonyesha vyako vinapatikana na vinafaa.

# step_safety_equipment_instruction_3
source: Confirm first aid kit, spill kit, and PPE inventory is complete.
sw: Thibitisha seti ya kwanza ya msaada, seti ya kuvuja, na hesabu ya PPE ni kamili.

# step_safety_equipment_instruction_4
source: Document any missing or deficient safety equipment with photos.
sw: Andika vifaa vya dharura vinavyokosa au vya ubora mdogo kwa picha.

# step_operational_tests_title
source: Operational Tests
sw: Vipimo vya Uendeshaji

# step_operational_tests_summary
source: Close the inspection with dynamic operational checks before releasing the vehicle.
sw: Maliza ukaguzi na vipimo vya uendeshaji kabla ya kuachilia gari.

# step_operational_tests_instruction_1
source: Conduct brake responsiveness test noting pedal feel and stopping distance.
sw: Fanya jaribio la utendakazi wa breki ukitambua hisia za pedal na umbali wa kusimama.

# step_operational_tests_instruction_2
source: Cycle steering lock-to-lock listening for abnormal noises or resistance.
sw: Geuza mwelekeo wa udhibiti kusikiliza kelele zisizo za kawaida au upinzani.

# step_operational_tests_instruction_3
source: Start the engine, observe idle quality, warning lights, and vibrations.
sw: Washa injini, angalia ubora wa idle, taa za onyo, na vibration.

# step_operational_tests_instruction_4
source: Perform transmission shifting test verifying smooth engagement in all ranges.
sw: Fanya jaribio la kubadilisha gia kuthibitisha uendeshaji laini katika anuwai zote.
